In [1]:
import pandas as pd
import numpy as np

In [6]:
# Loading raw data 
raw_data = pd.read_csv("/Users/gurjitsingh/Desktop/MS Data Science/MS_Project_Python/raw_datasets/Producer_prices/Prices_E_All_Data_(Normalized)/Prices_E_All_Data_(Normalized).csv")
raw_data.head()

,Area Code,Area Code (M49),Area,Item Code,Item Code (CPC),Item,Element Code,Element,Year Code,Year,Months Code,Months,Unit,Value,Flag
0,2,'004,Afghanistan,221,'01371,"Almonds, in shell",5530,Producer Price (LCU/tonne),1993,1993,7021,Annual value,LCU,46000.0,A
1,2,'004,Afghanistan,221,'01371,"Almonds, in shell",5530,Producer Price (LCU/tonne),1994,1994,7021,Annual value,LCU,50000.0,A
2,2,'004,Afghanistan,221,'01371,"Almonds, in shell",5530,Producer Price (LCU/tonne),1995,1995,7021,Annual value,LCU,62000.0,A
3,2,'004,Afghanistan,221,'01371,"Almonds, in shell",5530,Producer Price (LCU/tonne),1996,1996,7021,Annual value,LCU,50000.0,A
4,2,'004,Afghanistan,221,'01371,"Almonds, in shell",5530,Producer Price (LCU/tonne),1997,1997,7021,Annual value,LCU,41000.0,A

In [7]:
raw_data.shape

(1261761, 15)

In [8]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1261761 entries, 0 to 1261760
Data columns (total 15 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   Area Code        1261761 non-null  int64
 1   Area Code (M49)  1261761 non-null  object
 2   Area             1261761 non-null  object
 3   Item Code        1261761 non-null  int64
 4   Item Code (CPC)  1261761 non-null  object
 5   Item             1261761 non-null  object
 6   Element Code     1261761 non-null  int64
 7   Element          1261761 non-null  object
 8   Year Code        1261761 non-null  int64
 9   Year             1261761 non-null  int64
 10  Months Code      1261761 non-null  int64
 11  Months           1261761 non-null  object
 12  Unit             841850 non-null   object
 13  Value            1261761 non-null  float64
 14  Flag             1261761 non-null  object
dtypes: float64(1), int64(6), object(8)
memory usage: 144.4+ MB

In [9]:
raw_data.columns

Index(['Area Code', 'Area Code (M49)', 'Area', 'Item Code', 'Item Code (CPC)',
       'Item', 'Element Code', 'Element', 'Year Code', 'Year', 'Months Code',
       'Months', 'Unit', 'Value', 'Flag'],
      dtype='object')

In [10]:
# Dropping the unnecessary columns
filtered_1 = raw_data.drop(['Area Code (M49)','Item Code (CPC)','Element Code'], axis=1)
filtered_1.head()

,Area Code,Area,Item Code,Item,Element,Year Code,Year,Months Code,Months,Unit,Value,Flag
0,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1993,1993,7021,Annual value,LCU,46000.0,A
1,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1994,1994,7021,Annual value,LCU,50000.0,A
2,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1995,1995,7021,Annual value,LCU,62000.0,A
3,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1996,1996,7021,Annual value,LCU,50000.0,A
4,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1997,1997,7021,Annual value,LCU,41000.0,A

In [11]:
np.sort(filtered_1['Year'].unique())

array([1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
       2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023,
       2024])

In [193]:
filtered_1['Months'].unique()

array(['Annual value', 'July', 'August', 'September', 'October',
       'November', 'December', 'January', 'February', 'March', 'April',
       'May', 'June'], dtype=object)

We would like to keep the producer prices data by the 'Annual value' only.
And, we would drop the rows having monthly-data as we are not interested in 
looking at the monthly-data.

In [12]:
# filter the data to obtain desired rows
filtered_2 = filtered_1.loc[filtered_1['Months'] == 'Annual value'].drop(
    ['Months', 'Months Code', 'Unit', 'Flag'], axis=1)
filtered_2.head()

,Area Code,Area,Item Code,Item,Element,Year Code,Year,Value
0,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1993,1993,46000.0
1,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1994,1994,50000.0
2,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1995,1995,62000.0
3,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1996,1996,50000.0
4,2,Afghanistan,221,"Almonds, in shell",Producer Price (LCU/tonne),1997,1997,41000.0

In [195]:
filtered_2.shape

(915217, 8)

In [196]:
filtered_2['Element'].unique()

array(['Producer Price (LCU/tonne)', 'Producer Price (SLC/tonne)',
       'Producer Price Index (2014-2016 = 100)',
       'Producer Price (USD/tonne)'], dtype=object)

In [13]:
# Reshaping the dataframe from long to wide format
filtered_2_pivoted = filtered_2.pivot_table(
    index=['Area Code', 'Area', 'Item Code', 'Item', 'Year', 'Year Code'], 
    columns='Element', 
    values='Value')
filtered_2_pivoted.head()

Element                                           Producer Price (LCU/tonne)  \
Area Code Area    Item Code Item  Year Year Code
1         Armenia 15        Wheat 1997 1997                         110589.0
                                  1998 1998                         103795.0
                                  1999 1999                          94996.0
                                  2000 2000                          88200.0
                                  2001 2001                          92170.0

Element                                           Producer Price (SLC/tonne)  \
Area Code Area    Item Code Item  Year Year Code
1         Armenia 15        Wheat 1997 1997                         110589.0
                                  1998 1998                         103795.0
                                  1999 1999                          94996.0
                                  2000 2000                          88200.0
                                  2001 2001                          92170.0

Element                                           Producer Price (USD/tonne)  \
Area Code Area    Item Code Item  Year Year Code
1         Armenia 15        Wheat 1997 1997                            225.3
                                  1998 1998                            205.6
                                  1999 1999                            177.5
                                  2000 2000                            163.5
                                  2001 2001                            166.0

Element                                           Producer Price Index (2014-2016 = 100)
Area Code Area    Item Code Item  Year Year Code
1         Armenia 15        Wheat 1997 1997                                        89.40
                                  1998 1998                                        83.91
                                  1999 1999                                        76.79
                                  2000 2000                                        71.30
                                  2001 2001                                        74.51

In [14]:
# Resetting the index is important after pivoting
filtered_2_pivoted = filtered_2_pivoted.reset_index()
filtered_2_pivoted.head()

Element,Area Code,Area,Item Code,Item,Year,Year Code,Producer Price (LCU/tonne),Producer Price (SLC/tonne),Producer Price (USD/tonne),Producer Price Index (2014-2016 = 100)
0,1,Armenia,15,Wheat,1997,1997,110589.0,110589.0,225.3,89.40
1,1,Armenia,15,Wheat,1998,1998,103795.0,103795.0,205.6,83.91
2,1,Armenia,15,Wheat,1999,1999,94996.0,94996.0,177.5,76.79
3,1,Armenia,15,Wheat,2000,2000,88200.0,88200.0,163.5,71.30
4,1,Armenia,15,Wheat,2001,2001,92170.0,92170.0,166.0,74.51

In [199]:
filtered_2_pivoted.shape

(423530, 10)

 When you .reset_index(), it only resets the index for rows, not for columns. Column MultiIndexes persist unless explicitly removed.

In [200]:
filtered_2_pivoted.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Year', 'Year Code',
       'Producer Price (LCU/tonne)', 'Producer Price (SLC/tonne)',
       'Producer Price (USD/tonne)', 'Producer Price Index (2014-2016 = 100)'],
      dtype='object', name='Element')

In [15]:
filtered_2_pivoted.columns.name = None
filtered_2_pivoted.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Year', 'Year Code',
       'Producer Price (LCU/tonne)', 'Producer Price (SLC/tonne)',
       'Producer Price (USD/tonne)', 'Producer Price Index (2014-2016 = 100)'],
      dtype='object')

In [8]:
filtered_2_pivoted.head()

,Area Code,Area,Item Code,Item,Year,Year Code,Producer Price (LCU/tonne),Producer Price (SLC/tonne),Producer Price (USD/tonne),Producer Price Index (2014-2016 = 100)
0,1,Armenia,15,Wheat,1997,1997,110589.0,110589.0,225.3,89.40
1,1,Armenia,15,Wheat,1998,1998,103795.0,103795.0,205.6,83.91
2,1,Armenia,15,Wheat,1999,1999,94996.0,94996.0,177.5,76.79
3,1,Armenia,15,Wheat,2000,2000,88200.0,88200.0,163.5,71.30
4,1,Armenia,15,Wheat,2001,2001,92170.0,92170.0,166.0,74.51

In [14]:
filtered_2_pivoted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 423530 entries, 0 to 423529
Data columns (total 10 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   Area Code                               423530 non-null  int64
 1   Area                                    423530 non-null  object
 2   Item Code                               423530 non-null  int64
 3   Item                                    423530 non-null  object
 4   Year                                    423530 non-null  int64
 5   Year Code                               423530 non-null  int64
 6   Producer Price (LCU/tonne)              166330 non-null  float64
 7   Producer Price (SLC/tonne)              166274 non-null  float64
 8   Producer Price (USD/tonne)              162702 non-null  float64
 9   Producer Price Index (2014-2016 = 100)  419911 non-null  float64
dtypes: float64(4), int64(4), object(2)
memory usage: 32.3+ MB

We are removing the producer prices in LCU and SLC, while keeping the other two. 
Another thing important to keep in mind here is that there are lots of missing values
for the regular producer prices. May be we can go forward to forecast producer price 
indexes. However, we need to further remove some rows before we decide.

In [16]:
filtered_3_pivoted = filtered_2_pivoted.drop(
    ['Producer Price (LCU/tonne)', 'Producer Price (SLC/tonne)'], 
    axis=1)
filtered_3_pivoted.head()

,Area Code,Area,Item Code,Item,Year,Year Code,Producer Price (USD/tonne),Producer Price Index (2014-2016 = 100)
0,1,Armenia,15,Wheat,1997,1997,225.3,89.40
1,1,Armenia,15,Wheat,1998,1998,205.6,83.91
2,1,Armenia,15,Wheat,1999,1999,177.5,76.79
3,1,Armenia,15,Wheat,2000,2000,163.5,71.30
4,1,Armenia,15,Wheat,2001,2001,166.0,74.51

In [205]:
filtered_3_pivoted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 423530 entries, 0 to 423529
Data columns (total 8 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   Area Code                               423530 non-null  int64
 1   Area                                    423530 non-null  object
 2   Item Code                               423530 non-null  int64
 3   Item                                    423530 non-null  object
 4   Year                                    423530 non-null  int64
 5   Year Code                               423530 non-null  int64
 6   Producer Price (USD/tonne)              162702 non-null  float64
 7   Producer Price Index (2014-2016 = 100)  419911 non-null  float64
dtypes: float64(2), int64(4), object(2)
memory usage: 25.9+ MB

In [17]:
# Finding the number of missing values in each column
filtered_3_pivoted.isna().sum()

Area Code                                      0
Area                                           0
Item Code                                      0
Item                                           0
Year                                           0
Year Code                                      0
Producer Price (USD/tonne)                260828
Producer Price Index (2014-2016 = 100)      3619
dtype: int64

In [207]:
filtered_3_pivoted['Area'].unique().shape[0]

181

In [18]:
filtered_3_pivoted['Area'].value_counts().tail(20)

Area
Saint Kitts and Nevis       273
Samoa                       235
Central African Republic    214
Uzbekistan                  116
Bahrain                     105
Belgium-Luxembourg           76
Ethiopia PDR                 72
Tonga                        42
Lesotho                      40
Sudan                        13
Réunion                      11
Mauritania                   11
Czechoslovakia                7
Comoros                       7
Haiti                         5
Martinique                    5
Guadeloupe                    4
Guatemala                     4
French Guiana                 4
French Polynesia              2
Name: count, dtype: int64

In [19]:
# Number of countries with fewer than 100 rows of data
country_counts = pd.DataFrame(filtered_3_pivoted['Area'].value_counts())
undesired_countries = country_counts.loc[country_counts['count'] < 100].index.to_list()
len(undesired_countries)

15

In [34]:
filtered_3_pivoted['Item'].unique().shape[0]

234

In [211]:
filtered_3_pivoted['Item'].value_counts()

Item
Agriculture                                                       5051
Roots and Tubers, Total                                           4958
Livestock                                                         4930
Vegetables&Melons, Total                                          4886
Raw milk of cattle                                                4871
                                                                  ...
Stillingia oil                                                      34
Vegetable tallow                                                    34
Meat of other domestic camelids, fresh or chilled                   34
Meat of other domestic camelids, fresh or chilled (biological)      34
Kapok fruit                                                         34
Name: count, Length: 234, dtype: int64

In [20]:
# Items with fewer than 100 rows of data (considered undesired)
item_counts = pd.DataFrame(filtered_3_pivoted['Item'].value_counts())
undesired_items_1 = item_counts.loc[item_counts['count'] < 100].index.to_list()
undesired_items_1[0:10]

['Hempseed',
 'Other pome fruits',
 'Other bananas (excluding cavendish and cooking bananas)',
 'Meat of pigeons and other birds n.e.c., fresh, chilled or frozen (biological)',
 'Cooking bananas',
 'Balata, gutta-percha, guayule, chicle and similar natural gums in primary forms or in plates, sheets or strip',
 'Meat of other domestic rodents, fresh or chilled',
 'Meat of other domestic rodents, fresh or chilled (biological)',
 'Tea nes (herbal tea)',
 'Stillingia oil']

In [230]:
filtered_3_pivoted['Item'].unique()

array(['Wheat', 'Barley', 'Maize (corn)', 'Rye', 'Oats', 'Cereals n.e.c.',
       'Potatoes', 'Sugar beet', 'Beans, dry', 'Peas, dry',
       'Lentils, dry', 'Vetches', 'Other pulses n.e.c.',
       'Walnuts, in shell', 'Cabbages', 'Tomatoes',
       'Cauliflowers and broccoli', 'Cucumbers and gherkins',
       'Eggplants (aubergines)',
       'Chillies and peppers, green (Capsicum spp. and Pimenta spp.)',
       'Onions and shallots, green',
       'Onions and shallots, dry (excluding dehydrated)', 'Green garlic',
       'Other beans, green', 'Peas, green', 'Carrots and turnips',
       'Mushrooms and truffles', 'Other vegetables, fresh n.e.c.',
       'Apples', 'Pears', 'Quinces', 'Apricots', 'Cherries',
       'Peaches and nectarines', 'Plums and sloes', 'Other stone fruits',
       'Strawberries', 'Raspberries', 'Currants', 'Grapes', 'Watermelons',
       'Figs', 'Other fruits, n.e.c.', 'Unmanufactured tobacco',
       'Meat of cattle with the bone, fresh or chilled',
       'Raw milk of cattle',
       'Meat of cattle with the bone, fresh or chilled (biological)',
       'Meat of sheep, fresh or chilled', 'Raw milk of sheep',
       'Shorn wool, greasy, including fleece-washed shorn wool',
       'Meat of sheep, fresh or chilled (biological)',
       'Raw milk of goats', 'Meat of pig with the bone, fresh or chilled',
       'Meat of pig with the bone, fresh or chilled (biological)',
       'Meat of chickens, fresh or chilled', 'Hen eggs in shell, fresh',
       'Eggs from other birds in shell, fresh, n.e.c.',
       'Meat of chickens, fresh or chilled (biological)',
       'Meat of rabbits and hares, fresh or chilled',
       'Meat of rabbits and hares, fresh or chilled (biological)',
       'Natural honey', 'Cereals, primary', 'Roots and Tubers, Total',
       'Pulses, Total', 'Treenuts, Total', 'Vegetables Primary',
       'Fruit Primary', 'Meat, Total', 'Milk, Total', 'Eggs Primary',
       'Vegetables&Melons, Total', 'Fruit excl Melons, Total',
       'Coarse Grain, Total', 'Livestock', 'Agriculture', 'Rice',
       'Millet', 'Sugar cane', 'Almonds, in shell',
       'Pistachios, in shell',
       'Other nuts (excluding wild edible nuts and groundnuts), in shell, n.e.c.',
       'Olives', 'Sunflower seed', 'Sesame seed', 'Seed cotton, unginned',
       'Cotton seed', 'Linseed', 'Oranges', 'Other citrus fruit, n.e.c.',
       'Cantaloupes and other melons',
       'Anise, badian, coriander, cumin, caraway, fennel and juniper berries, raw',
       'Cotton lint, ginned', 'Meat of goat, fresh or chilled',
       'Meat of goat, fresh or chilled (biological)',
       'Meat of camels, fresh or chilled', 'Raw milk of camel',
       'Meat of camels, fresh or chilled (biological)',
       'Game meat, fresh, chilled or frozen',
       'Silk-worm cocoons suitable for reeling',
       'Oilcrops, Oil Equivalent', 'Fibre Crops Primary',
       'Citrus Fruit, Total', 'Sorghum',
       'Broad beans and horse beans, dry', 'Chestnuts, in shell',
       'Soya beans', 'Lettuce and chicory', 'Spinach',
       'Pumpkins, squash and gourds',
       'Leeks and other alliaceous vegetables',
       'Broad beans and horse beans, green', 'Okra',
       'Tangerines, mandarins, clementines', 'Lemons and limes',
       'Sour cherries', 'Dates', 'Hop cones',
       'Other stimulant, spice and aromatic crops, n.e.c.',
       'Raw milk of buffalo',
       'Meat of ducks, fresh or chilled (biological)',
       'Meat of geese, fresh or chilled (biological)',
       'Meat of turkeys, fresh or chilled',
       'Meat of turkeys, fresh or chilled (biological)', 'Triticale',
       'Chick peas, dry', 'Groundnuts, excluding shelled',
       'Rape or colza seed', 'Artichokes', 'Locust beans (carobs)',
       'Pomelos and grapefruits',
       'Chillies and peppers, dry (Capsicum spp., Pimenta spp.), raw',
       'Horse meat, fresh or chilled',
       'Horse meat, fresh or chilled (biological)', 'Sweet potatoes',
       'Cassava, fresh', 'Bananas', 'Mangoes, guavas and mangosteens',
       'Avocados', 'Pineapples', 'Coffee, green', 'Yams',
       'Bananas cavendish', 'Canary seed', 'Lupins', 'Tung nuts',
       'Safflower seed', 'Other oil seeds, n.e.c.', 'Asparagus',
       'String beans', 'Papayas', 'Tea leaves', 'Maté leaves',
       'Flax, processed but not spun', 'Other fibre crops, raw, n.e.c.',
       'Meat of ducks, fresh or chilled',
       'Meat of geese, fresh or chilled', 'Beeswax', 'Cow peas, dry',
       'Green corn (maize)',
       'Other berries and fruits of the genus vaccinium n.e.c.',
       'Persimmons', 'Kiwi fruit', 'Other tropical fruits, n.e.c.',
       'Mixed grain', 'Poppy seed', 'Gooseberries', 'Taro',
       'Coconuts, in shell',
       'Other bananas (excluding cavendish and cooking bananas)',
       'Plantains', 'Cooking bananas', 'Plantains and cooking bananas',
       'Other sugar crops n.e.c.', 'Pigeon peas, dry',
       'Cashew nuts, in shell', 'Areca nuts', 'Castor oil seeds',
       'Ginger, raw', 'Jute, raw or retted',
       'Kenaf, and other textile bast fibres, raw or retted',
       'Natural rubber in primary forms',
       'Meat of buffalo, fresh or chilled',
       'Meat of buffalo, fresh or chilled (biological)',
       'Jute & Jute-like Fibres', 'Buckwheat',
       'Edible roots and tubers with high starch or inulin content, n.e.c., fresh',
       'Mustard seed', 'Nutmeg, mace, cardamoms, raw',
       'Other meat of mammals, fresh or chilled', 'Quinoa',
       'Brazil nuts, in shell', 'Cocoa beans', 'Pepper (Piper spp.), raw',
       'Meat of asses, fresh or chilled',
       'Meat of asses, fresh or chilled (biological)',
       'Meat of other domestic rodents, fresh or chilled',
       'Meat of other domestic rodents, fresh or chilled (biological)',
       'Oil palm fruit', 'Palm kernels', 'Palm oil', 'Cashewapple',
       'Ramie, raw or retted', 'Sisal, raw',
       'Balata, gutta-percha, guayule, chicle and similar natural gums in primary forms or in plates, sheets or strip',
       'Yautia', 'Cinnamon and cinnamon-tree flowers, raw',
       'Hazelnuts, in shell', 'Melonseed', 'Peppermint, spearmint',
       'Meat of pigeons and other birds n.e.c., fresh, chilled or frozen',
       'Meat of pigeons and other birds n.e.c., fresh, chilled or frozen (biological)',
       'Blueberries', 'Cranberries', 'Cloves (whole stems), raw',
       'Meat of mules, fresh or chilled',
       'Meat of mules, fresh or chilled (biological)', 'Vegetable tallow',
       'Stillingia oil', 'Hempseed', 'Vanilla, raw',
       'Agave fibres, raw, n.e.c.', 'Abaca, manila hemp, raw',
       'Other pome fruits', 'Pyrethrum, dried flowers', 'Chicory roots',
       'Fonio', 'Kola nuts', 'Karite nuts (sheanuts)',
       'True hemp, raw or retted', 'Tea nes (herbal tea)',
       'Bambara beans, dry',
       'Meat of other domestic camelids, fresh or chilled',
       'Meat of other domestic camelids, fresh or chilled (biological)',
       'Kapok fruit'], dtype=object)

In [21]:
# list of more undesired items
undesired_items_2 = ['Meat of other domestic camelids, fresh or chilled',
                   'Meat of other domestic camelids, fresh or chilled (biological)',
                   'Other pome fruits', 'Other sugar crops n.e.c.',
                   'Meat of pigeons and other birds n.e.c., fresh, chilled or frozen (biological)',
                   'Meat of pigeons and other birds n.e.c., fresh, chilled or frozen',
                   'Meat of other domestic rodents, fresh or chilled',
                   'Meat of other domestic rodents, fresh or chilled (biological)',
                   'Other meat of mammals, fresh or chilled',
                   'Edible roots and tubers with high starch or inulin content, n.e.c., fresh',
                   'Other tropical fruits, n.e.c.', 'Other berries and fruits of the genus vaccinium n.e.c.',
                   'Other fibre crops, raw, n.e.c.', 'Other oil seeds, n.e.c.',
                   'Other stimulant, spice and aromatic crops, n.e.c.',
                   'Fibre Crops Primary', 'Other citrus fruit, n.e.c.', 
                   'Other nuts (excluding wild edible nuts and groundnuts), in shell, n.e.c.',
                   'Eggs from other birds in shell, fresh, n.e.c.', 
                   'Other stone fruits', 'Other vegetables, fresh n.e.c.', 
                   'Other pulses n.e.c.', 'Cereals n.e.c.', 'Other fruits, n.e.c.']

In [22]:
# total number of undesired items to be removed
items_to_remove = list(set(undesired_items_1 + undesired_items_2))
len(items_to_remove)

32

In [23]:
# filtering data by removing undesired countries and items
cleaned_data = filtered_3_pivoted.loc[
    (~filtered_3_pivoted['Item'].isin(items_to_remove)) & 
    (~filtered_3_pivoted['Area'].isin(undesired_countries)), :]
cleaned_data.head()

,Area Code,Area,Item Code,Item,Year,Year Code,Producer Price (USD/tonne),Producer Price Index (2014-2016 = 100)
0,1,Armenia,15,Wheat,1997,1997,225.3,89.40
1,1,Armenia,15,Wheat,1998,1998,205.6,83.91
2,1,Armenia,15,Wheat,1999,1999,177.5,76.79
3,1,Armenia,15,Wheat,2000,2000,163.5,71.30
4,1,Armenia,15,Wheat,2001,2001,166.0,74.51

In [23]:
cleaned_data.shape

(392948, 8)

In [218]:
cleaned_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 390695 entries, 0 to 423529
Data columns (total 8 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   Area Code                               390695 non-null  int64
 1   Area                                    390695 non-null  object
 2   Item Code                               390695 non-null  int64
 3   Item                                    390695 non-null  object
 4   Year                                    390695 non-null  int64
 5   Year Code                               390695 non-null  int64
 6   Producer Price (USD/tonne)              157025 non-null  float64
 7   Producer Price Index (2014-2016 = 100)  387794 non-null  float64
dtypes: float64(2), int64(4), object(2)
memory usage: 26.8+ MB

In [40]:
len(cleaned_data['Item'].unique())

202

In [24]:
# Finding rows where both PPI and PP are missing
missing_data = cleaned_data.loc[(cleaned_data['Producer Price Index (2014-2016 = 100)'].isna()) &
                 (cleaned_data['Producer Price (USD/tonne)'].isna()), :]
missing_data.shape

(92, 8)

In [25]:
# Removing the rows where both PP and PPI are missing
cleaned_data_1 = cleaned_data.drop(missing_data.index, axis=0)
cleaned_data_1.shape

(392856, 8)

In [26]:
cleaned_data_1.loc[cleaned_data_1['Producer Price Index (2014-2016 = 100)'].isna(), :].info()

<class 'pandas.core.frame.DataFrame'>
Index: 3062 entries, 644 to 415470
Data columns (total 8 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   Area Code                               3062 non-null   int64
 1   Area                                    3062 non-null   object
 2   Item Code                               3062 non-null   int64
 3   Item                                    3062 non-null   object
 4   Year                                    3062 non-null   int64
 5   Year Code                               3062 non-null   int64
 6   Producer Price (USD/tonne)              3062 non-null   float64
 7   Producer Price Index (2014-2016 = 100)  0 non-null      float64
dtypes: float64(2), int64(4), object(2)
memory usage: 215.3+ KB

In [ ]:
# This is our final dataset for Producer Prices
cleaned_data_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 390603 entries, 0 to 423529
Data columns (total 8 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   Area Code                               390603 non-null  int64
 1   Area                                    390603 non-null  object
 2   Item Code                               390603 non-null  int64
 3   Item                                    390603 non-null  object
 4   Year                                    390603 non-null  int64
 5   Year Code                               390603 non-null  int64
 6   Producer Price (USD/tonne)              157025 non-null  float64
 7   Producer Price Index (2014-2016 = 100)  387794 non-null  float64
dtypes: float64(2), int64(4), object(2)
memory usage: 26.8+ MB

In [ ]:
len(cleaned_data_1['Area'].unique())

166

In [45]:
len(cleaned_data_1['Item'].unique())

202

In [27]:
cleaned_data_1.head()

,Area Code,Area,Item Code,Item,Year,Year Code,Producer Price (USD/tonne),Producer Price Index (2014-2016 = 100)
0,1,Armenia,15,Wheat,1997,1997,225.3,89.40
1,1,Armenia,15,Wheat,1998,1998,205.6,83.91
2,1,Armenia,15,Wheat,1999,1999,177.5,76.79
3,1,Armenia,15,Wheat,2000,2000,163.5,71.30
4,1,Armenia,15,Wheat,2001,2001,166.0,74.51

In [28]:
# renaming columns
cleaned_data_2 = cleaned_data_1.rename(
    columns = {
       'Area Code': 'area_code', 
       'Area': 'area', 
       'Item Code': 'item_code', 
       'Item': 'item', 
       'Year': 'year', 
       'Year Code': 'year_code',
       'Producer Price (USD/tonne)': 'producer_price_USD_per_tonne', 
       'Producer Price Index (2014-2016 = 100)': 'producer_price_index'
    }
)
cleaned_data_2.head()

,area_code,area,item_code,item,year,year_code,producer_price_USD_per_tonne,producer_price_index
0,1,Armenia,15,Wheat,1997,1997,225.3,89.40
1,1,Armenia,15,Wheat,1998,1998,205.6,83.91
2,1,Armenia,15,Wheat,1999,1999,177.5,76.79
3,1,Armenia,15,Wheat,2000,2000,163.5,71.30
4,1,Armenia,15,Wheat,2001,2001,166.0,74.51

In [ ]:
# exporting cleaned data as csv file
cleaned_data_2.to_csv('cleaned_datasets/producer_prices_cleaned.csv', index=False)